
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>编程工具 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="工欲善其事必先利其器">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../rust-jumpstart/what-is-this.html" />
    
    
    <link rel="prev" href="goodbye-windows.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    R:Z 从零开始的RustOS编写体验指南
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Introduction</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="what-is-this.html">
            
                <a href="what-is-this.html">
            
                    
                    这个指南是什么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="from_one.html">
            
                <a href="from_one.html">
            
                    
                    从一开始
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="goodbye-windows.html">
            
                <a href="goodbye-windows.html">
            
                    
                    Goodbye Windows
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.4" data-path="tools.html">
            
                <a href="tools.html">
            
                    
                    编程工具
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">Rust Jumpstart</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../rust-jumpstart/what-is-this.html">
            
                <a href="../rust-jumpstart/what-is-this.html">
            
                    
                    这是什么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="../rust-jumpstart/environment.html">
            
                <a href="../rust-jumpstart/environment.html">
            
                    
                    环境配置
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">rCore 之旅</li>
        
        
    

    
        
        <li class="header">代码之前</li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="../../codes/ex1/ex1.html">
            
                <a href="../../codes/ex1/ex1.html">
            
                    
                    ex1: Hello World
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="../../codes/ex2/ex2.html">
            
                <a href="../../codes/ex2/ex2.html">
            
                    
                    ex2: Cargo 搭建项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.3" data-path="../../codes/ex3/ex3.html">
            
                <a href="../../codes/ex3/ex3.html">
            
                    
                    ex3: 注释有四种写法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="../../codes/ex4/ex4.md">
            
                <span>
            
                    
                    ex4: 打印与参数
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">基本概念</li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="../../codes/ex5/ex5.html">
            
                <a href="../../codes/ex5/ex5.html">
            
                    
                    ex5: 标量 (Primitives —— Scalar Types)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="../../codes/ex6/ex6.html">
            
                <a href="../../codes/ex6/ex6.html">
            
                    
                    ex6: 字面量 (Literals)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.3" data-path="../../codes/ex7/ex7.html">
            
                <a href="../../codes/ex7/ex7.html">
            
                    
                    ex7: tuple
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.4" data-path="../../codes/ex8/ex8.html">
            
                <a href="../../codes/ex8/ex8.html">
            
                    
                    ex8: array 与 slice
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.5" data-path="../../codes/ex9/ex9.html">
            
                <a href="../../codes/ex9/ex9.html">
            
                    
                    ex9: struct
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.6" data-path="../../codes/ex10/ex10.html">
            
                <a href="../../codes/ex10/ex10.html">
            
                    
                    ex10: enum
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.7" data-path="../../codes/ex11/ex11.html">
            
                <a href="../../codes/ex11/ex11.html">
            
                    
                    ex11: 打印与 Debug
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">语法特性</li>
        
        
    
        <li class="chapter " data-level="7.1" data-path="../../codes/ex12/ex12.md">
            
                <span>
            
                    
                    ex12: 变量绑定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="7.2" data-path="../../codes/ex13/ex13.md">
            
                <span>
            
                    
                    ex13: Statement 与 Expression
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">附录</li>
        
        
    
        <li class="chapter " data-level="8.1" data-path="../rcore_journey/Lab_Q&A.html">
            
                <a href="../rcore_journey/Lab_Q&A.html">
            
                    
                    Lab Q&A
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="8.2" data-path="../rcore_journey/reference.html">
            
                <a href="../rcore_journey/reference.html">
            
                    
                    汇流成河
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >编程工具</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F16;&#x7A0B;&#x5DE5;&#x5177;">&#x7F16;&#x7A0B;&#x5DE5;&#x5177;</h1>
<p>&#x53E4;&#x8BDD;&#x8BF4;&#x7684;&#x597D;&#xFF1A;&#x201C;&#x5DE5;&#x6B32;&#x5584;&#x5176;&#x4E8B;&#x5FC5;&#x5148;&#x5229;&#x5176;&#x5668;&#x201D;&#x3002;&#x867D;&#x7136;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x5927;&#x795E;&#x6765;&#x8BF4;&#xFF0C;&#x4F30;&#x8BA1;&#x54EA;&#x6015;&#x5C31;&#x7ED9;&#x4ED6;&#x4EEC;&#x4E00;&#x6839;&#x7B14;&#x548C;&#x4E00;&#x5757;&#x751F;&#x677F;&#x5B50;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x80FD;&#x62FF;&#x7B14;&#x5728;&#x7EB8;&#x5E26;&#x4E0A;&#x6253;&#x4E0A;&#x6D1E;&#xFF0C;&#x585E;&#x5230;&#x677F;&#x5B50;&#x91CC;&#x8DD1;&#x8D77;&#x7A0B;&#x5E8F;&#x6765;&#xFF08;&#x6307;&#x7684;&#x662F;&#x7EB8;&#x5E26;&#x8BA1;&#x7B97;&#x673A;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x90A3;&#x4E48;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x4E0A;&#x624B;&#x7F16;&#x5199;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x597D;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x5DE5;&#x5177;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x7F16;&#x8F91;&#x5668;">&#x7F16;&#x8F91;&#x5668;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x4EE5;&#x524D;&#x63A5;&#x89E6;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7F16;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x63A5;&#x89E6;&#x8FC7; IDE &#xFF0C;&#x5373;&#x201C;&#x96C6;&#x6210;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x201D;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4; Dev C++, Eclipse, Visual Studio &#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x5927;&#x591A;&#x5E2E;&#x4F60;&#x96C6;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F7F;&#x5F97;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4E13;&#x6CE8;&#x4E8E;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6309;&#x94AE;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x8981;&#x5728;&#x8FD9;&#x91CC;&#x63A8;&#x8350;&#x7684;&#x5E76;&#x4E0D;&#x662F; IDE &#xFF0C;&#x800C;&#x662F;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x8BF4;&#x5F97;&#x7B80;&#x5355;&#x4E00;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9AD8;&#x7EA7;&#x7684;&#x201C;&#x8BB0;&#x4E8B;&#x672C;&#x201D;&#xFF0C;&#x4F60;&#x80FD;&#x5728;&#x91CC;&#x9762;&#x5199;&#x5B57;&#x5C31;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x5982;&#x679C;&#x5B83;&#x8FD8;&#x80FD;&#x4E3A;&#x4F60;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x529F;&#x80FD;&#x90A3;&#x5C31;&#x66F4;&#x597D;&#x4E86;&#x3002;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x63A8;&#x8350;&#x4F7F;&#x7528; IDE &#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x7406;&#x7531;&#xFF1A;</p>
<ol>
<li><strong>&#x592A;&#x81C3;&#x80BF;</strong>: IDE &#x5927;&#x591A;&#x56E0;&#x4E3A;&#x96C6;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#x800C;&#x663E;&#x5F97;&#x975E;&#x5E38;&#x81C3;&#x80BF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7528;&#x8FC7; Vistual Studio &#x5C31;&#x77E5;&#x9053;&#x4E3A;&#x4E86;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x4E00;&#x4E2A; Visual Studio &#x9700;&#x8981;&#x82B1;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x8D76;&#x5FEB;&#x6DF1;&#x5165;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x9700;&#x8981;&#x5E26;&#x90A3;&#x4E48;&#x591A;&#x989D;&#x5916;&#x88C5;&#x5907;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x63D0;&#x793A;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x5C31;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x8DB3;&#x591F;&#x4E86;</li>
<li><strong>&#x592A;&#x9AD8;&#x7EA7;</strong>: IDE &#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x8FDB;&#x884C;&#x4E86;&#x8F83;&#x591A;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x8FD8;&#x4EE5; Visual Studio &#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x6DF1;&#x5165;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8FDE;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x7A76;&#x7ADF;&#x662F;&#x600E;&#x4E48;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x7684;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x4E86;&#x89E3;&#x5E93;&#x4E0E;&#x94FE;&#x63A5;&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x8981;&#x56DE;&#x5F52;&#x5230;&#x6700;&#x4E3A;&#x57FA;&#x672C;&#x7684;&#x7A0B;&#x5E8F;&#x2014;&#x2014;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x5730;&#x548C;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x76F4;&#x63A5;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;</li>
<li><strong>&#x8FD8;&#x6CA1;&#x6709;</strong>&#xFF1A;&#x989D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x624D;&#x662F;&#x6700;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;&#x7684; IDE &#x5BF9;&#x4E8E; Rust &#x7684;&#x652F;&#x6301;&#x8FD8;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x597D;&#xFF0C;&#x76EE;&#x524D;&#x6765;&#x8BF4;&#x5BF9;&#x4E8E; Rust &#x7684;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x5927;&#x591A;&#x6570;&#x6765;&#x81EA;&#x63D2;&#x4EF6;&#x3002;&#x4F60;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#x5B9E;&#x9645;&#x4E0A;&#x8BB8;&#x591A;&#x7F16;&#x8F91;&#x5668;&#x9760;&#x7740;&#x63D2;&#x4EF6;&#x5BF9; Rust &#x7684;&#x652F;&#x6301;&#x5C31;&#x5DF2;&#x7ECF;&#x5F88;&#x4F18;&#x79C0;&#x4E86;&#xFF0C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x4F7F;&#x7528; IDE &#x7684;&#x5FC5;&#x8981;&#x3002;&#x53EF;&#x4EE5;&#x67E5;&#x770B;<a href="https://areweideyet.com/" target="_blank">Are we (I)DE yet</a>&#x7F51;&#x7AD9;&#x67E5;&#x770B;&#x5404;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x4E0E; IDE &#x5BF9; Rust &#x7684;&#x652F;&#x6301;&#x60C5;&#x51B5;</li>
</ol>
<h3 id="windows">Windows</h3>
<p>&#x5728; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x4F7F;&#x7528; VS Code&#x3002;&#x7406;&#x7531;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li><strong>&#x7B80;&#x800C;&#x6613;&#x61C2;</strong>&#xFF1A;VS Code &#x5168;&#x540D;&#x4E3A; Visual Studio Code &#xFF0C;&#x4EBA;&#x5982;&#x5176;&#x540D;&#xFF0C;&#x8FD9;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x662F;&#x5FAE;&#x8F6F;&#x516C;&#x53F8;&#x5F00;&#x53D1;&#x7684;&#x514D;&#x8D39;&#x5F00;&#x6E90;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5DE5;&#x5177;&#x3002;&#x548C; Visual Studio &#x4E0D;&#x4E00;&#x6837;&#xFF0C;VS Code &#x76F4;&#x63A5;&#x652F;&#x6301; Windows, Linux &#x548C; macOS &#x4E09;&#x4E2A;&#x6700;&#x4E3A;&#x5E38;&#x89C1;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x591A;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x90FD;&#x6709;&#x652F;&#x6301;&#x3002;&#x800C;&#x4E14;&#x7528;&#x6237;&#x754C;&#x9762;&#x6BD4;&#x8F83;&#x53CB;&#x597D;&#xFF0C;&#x9002;&#x5408;&#x65B0;&#x4EBA;&#x3002;&#x5404;&#x7C7B;&#x63D2;&#x4EF6;&#x4E5F;&#x5F88;&#x4E30;&#x5BCC;&#xFF0C;&#x5B89;&#x88C5;&#x7B80;&#x5355;&#x3002;&#x4F5C;&#x4E3A;&#x4E0A;&#x624B;&#x96BE;&#x5EA6;&#x8F83;&#x4F4E;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;VS Code &#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x4E0A;&#x624B;&#x7F16;&#x7A0B;&#x7684;&#x4E0D;&#x4E8C;&#x9009;&#x62E9;&#x3002;</li>
<li><strong>&#x4E0E; WSL &#x5B8C;&#x7F8E;&#x5951;&#x5408;</strong>&#xFF1A;&#x6BD5;&#x7ADF;&#x90FD;&#x662F;&#x5FAE;&#x8F6F;&#x5BB6;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;VS Code &#x53EF;&#x4EE5;&#x5F88;&#x7B80;&#x5355;&#x5730;&#x505A;&#x5230;&#x8FDE;&#x63A5; WSL &#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x672C;&#x6CA1;&#x6709;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x7684; WSL &#x4E0A;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x7B80;&#x5355;&#x4E86;&#x5F88;&#x591A;</li>
<li><strong>&#x5BF9; Rust &#x7684;&#x652F;&#x6301;&#x8F83;&#x597D;</strong>&#xFF1A;&#x5728;&#x4F17;&#x591A;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5F53;&#x4E2D; VS Code &#x5229;&#x7528;&#x63D2;&#x4EF6;&#x4FBF;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5BF9; Rust &#x7684;&#x5404;&#x65B9;&#x9762;&#x652F;&#x6301;&#xFF0C;&#x5305;&#x62EC;&#x8BED;&#x6CD5;&#x9AD8;&#x4EAE;&#x3001;&#x81EA;&#x52A8;&#x8865;&#x5168;&#x3001;&#x4EE3;&#x7801;&#x8DF3;&#x8F6C;&#x3001;&#x8C03;&#x8BD5;&#x7B49;&#x5B9E;&#x7528;&#x529F;&#x80FD;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;VS Code &#x4E5F;&#x6CA1;&#x6709;&#x96C6;&#x6210;&#x8FC7;&#x591A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x9664;&#x4E86;&#x5728;&#x7F16;&#x8F91;&#x4EE3;&#x7801;&#x4E0A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x5916;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x5173;&#x7F16;&#x8BD1;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x6CA1;&#x6709;&#x8FC7;&#x591A;&#x63D2;&#x624B;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x638C;&#x63E1;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x7F16;&#x8BD1;&#x4E0E;&#x8FD0;&#x884C;&#x3002;</li>
</ol>
<p>&#x65E2;&#x7136;&#x4F18;&#x70B9;&#x5F88;&#x591A;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4F7F;&#x7528;&#x5462;&#xFF1F;VS Code &#x53EF;&#x4EE5;&#x5728;<a href="https://code.visualstudio.com/" target="_blank">&#x5B98;&#x7F51;</a>&#x4E0A;&#x8FDB;&#x884C;&#x4E0B;&#x8F7D;</p>
<h4 id="&#x63D2;&#x4EF6;">&#x63D2;&#x4EF6;</h4>
<p>&#x4E0B;&#x8F7D;&#x5E76;&#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x6587;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x8F91;&#x66F4;&#x52A0;&#x5F97;&#x5FC3;&#x5E94;&#x624B;&#x3002;&#x63D2;&#x4EF6;&#x7684;&#x5B89;&#x88C5;&#x4F4D;&#x4E8E;&#x5C4F;&#x5E55;&#x6700;&#x5DE6;&#x4FA7;&#x7684;&#x5DE5;&#x5177;&#x680F;&#x4E2D;&#x3002;</p>
<p><img src="../imgs/extension.png" alt="extentions"></p>
<p>&#x53EA;&#x9700;&#x8981;&#x5728;&#x641C;&#x7D22;&#x680F;&#x4E2D;&#x641C;&#x7D22;&#x5E76;&#x5B89;&#x88C5;&#x63D2;&#x4EF6;&#x5373;&#x53EF;</p>
<p>&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x5B89;&#x88C5;&#x7684;&#x63D2;&#x4EF6;&#x5217;&#x8868;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x4E2D;&#x6587;&#x652F;&#x6301;&#xFF1A;<code>Chinese (Simplified) Language Pack for Visual Studio Code</code>&#xFF08;&#x7B80;&#x4F53;&#x4E2D;&#x6587;&#xFF09;, <code>Chinese (Traditional) Language Pack for Visual Studio Code</code>&#xFF08;&#x7E41;&#x4F53;&#x4E2D;&#x6587;&#xFF09;</li>
<li>Rust&#xFF1A;<code>Rust</code> , <code>Rust Extension Pack</code></li>
<li>Markdown&#xFF1A;<code>Markdown All in one</code>,<code>Markdown Extended</code>, <code>Markdown Preview Enhanced</code>, <code>markdownlint</code></li>
<li>RISC-V ASM&#xFF08;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#xFF09;&#xFF1A;<code>RISC-V Support</code></li>
<li>&#x989D;&#x5916;&#x63A8;&#x8350;&#xFF1A;<ol>
<li>Git &#x5DE5;&#x5177;&#xFF1A;<code>git graph</code></li>
<li>&#x81EA;&#x52A8;&#x8865;&#x5168;&#x5DE5;&#x5177;&#xFF1A;<code>TabNine</code></li>
</ol>
</li>
</ol>
<h3 id="macos">macOS</h3>
<p>&#x672A;&#x5B8C;&#x5F85;&#x7EED;&#x3002;&#x3002;&#x3002;
<!-- 请增加对于 macOS 推荐的编辑器 --></p>
<h3 id="linux">Linux</h3>
<p>&#x6211;&#x4EEC;&#x9ED8;&#x8BA4;&#x73B0;&#x5728;&#x5C31;&#x5DF2;&#x7ECF;&#x5728;&#x4F7F;&#x7528; Linux &#x7684;&#x540C;&#x5B66;&#x80AF;&#x5B9A;&#x5DF2;&#x7ECF;&#x6709;&#x81EA;&#x5DF1;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x4E3A;&#x5B83;&#x88C5;&#x4E0A;&#x5BF9;&#x5E94;&#x7684; Rust &#x63D2;&#x4EF6;&#x3002;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://areweideyet.com/" target="_blank">Are we (I)DE yet</a>&#x4E0A;&#x7684;&#x8BF4;&#x660E;&#x3002;</p>
<h2 id="git">Git</h2>
<blockquote>
<p>&#x201C;&#x8FD9;&#x4E2A;&#x5FF5; geet&#xFF0C;&#x4E0D;&#x5FF5; dgit&#x201D;</p>
</blockquote>
<p>&#x53EA;&#x8981;&#x4F60;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5BF9;&#x8FD9;&#x4E2A;&#x8BCD;&#x6C47;&#x611F;&#x5230;&#x5F88;&#x719F;&#x6089;&#x3002;&#x5C31;&#x7B97;&#x4F60;&#x5BF9; Git &#x8FD9;&#x4E2A;&#x8BCD;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x719F;&#x6089;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x81F3;&#x5C11;&#x4F1A;&#x5BF9; GitHub &#x8FD9;&#x4E2A;&#x8BCD;&#x611F;&#x5230;&#x975E;&#x5E38;&#x719F;&#x6089;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x4E0A;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5F88;&#x591A;&#x7684;&#x5F00;&#x6E90;&#x4EE3;&#x7801;&#x9879;&#x76EE;&#xFF1B;&#x4E5F;&#x6709;&#x4EBA;&#x628A;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x4F5C;&#x4E3A;&#x67D0;&#x79CD;&#x6587;&#x4EF6;&#x4ED3;&#x5E93;&#xFF0C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#x4E0A;&#x53BB;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x4ED3;&#x5E93;&#xFF0C;&#x4F9B;&#x5176;&#x4ED6;&#x4EBA;&#x67E5;&#x9605;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x6240;&#x8FDB;&#x884C;&#x7684; Rust &#x8BED;&#x8A00;&#x5B66;&#x4E60;&#x4E0E; rCore &#x5B9E;&#x9A8C;&#x4E2D;&#x662F;&#x79BB;&#x4E0D;&#x5F00; Git &#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x8BF4;&#x660E;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="git-&#x7B80;&#x4ECB;">Git &#x7B80;&#x4ECB;</h3>
<p>Git &#x7A76;&#x7ADF;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x5230; wiki &#x4E0A;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#xFF0C;&#x5B83;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#x201D;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x4F7F;&#x7528;&#x542C;&#x4E0D;&#x61C2;&#x7684;&#x8BCD;&#x6C47;&#x7FFB;&#x8BD1;&#x542C;&#x4E0D;&#x61C2;&#x7684;&#x8BCD;&#x6C47;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x8DDF;&#x8E2A;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x5404;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x591A;&#x4E2A;&#x534F;&#x4F5C;&#x8005;&#x5171;&#x540C;&#x7EF4;&#x62A4;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x800C;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x5E72;&#x6270;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#xFF1A;</p>
<ol>
<li>&#x4FDD;&#x5B58;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#x4F20;&#x5230; Github &#x4E0A;&#x6765;&#x8FDB;&#x884C;&#x4FDD;&#x5B58;&#x3002;&#x8FD9;&#x6837;&#x4F60;&#x4E4B;&#x540E;&#x65E0;&#x8BBA;&#x9047;&#x5230;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x90FD;&#x8FD8;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x91CD;&#x65B0;&#x4E0B;&#x8F7D;&#x56DE;&#x6765;&#x3002;</li>
<li>&#x4E0B;&#x8F7D;&#x5B66;&#x4E60;&#x8D44;&#x6599;&#xFF1A;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x6863;&#x4EE5;&#x53CA;&#x4F60;&#x8981;&#x8FDB;&#x884C;&#x5B9E;&#x9A8C;&#x7684;&#x4ED3;&#x5E93;&#x5747;&#x5728; Github &#x4E0A;&#x8FDB;&#x884C;&#x50A8;&#x5B58;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4ECE; Github &#x4E0A;&#x8FDB;&#x884C;&#x4E0B;&#x8F7D;&#x3002;</li>
<li>&#x4EA4;&#x6D41;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x6210;&#x679C;&#xFF1A;Github &#x9664;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x50A8;&#x5B58;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4EA4;&#x6D41;&#x7684;&#x5E73;&#x53F0;&#xFF08;&#x5C31;&#x50CF;&#x662F;&#x8BBA;&#x575B;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x90A3;&#x91CC;&#x63D0;&#x51FA;&#x4F60;&#x5BF9;&#x8FD9;&#x4E2A;&#x6587;&#x6863;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x6216;&#x662F;&#x4E3A;&#x8FD9;&#x4E2A;&#x6587;&#x6863;&#x505A;&#x51FA;&#x8D21;&#x732E;&#xFF0C;&#x63D0;&#x4EA4;&#x4F60;&#x7684;&#x4FEE;&#x6539;&#x6210;&#x4E3A; pull request &#xFF0C;&#x6765;&#x4F7F;&#x4F60;&#x81EA;&#x5DF1;&#x4E5F;&#x6210;&#x4E3A;&#x6587;&#x6863;&#x7684;&#x7F16;&#x8F91;&#x8005;&#x4E4B;&#x4E00;&#x3002;</li>
</ol>
<p>&#x4F60;&#x4E5F;&#x8BB8;&#x9700;&#x8981;&#x5728;&#x672A;&#x6765;&#x82B1;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60; Github &#x5404;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EA;&#x4F1A;&#x5BF9;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B; Git &#x7684;&#x6700;&#x57FA;&#x7840;&#x7684;&#x4F7F;&#x7528;&#x6307;&#x5BFC;&#xFF0C;&#x9632;&#x6B62;&#x4F60;&#x5728;&#x5230;&#x5904;&#x4E71;&#x649E;&#x7684;&#x65F6;&#x5019;&#x6D6A;&#x8D39;&#x592A;&#x591A;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="git-&#x7684;&#x4F7F;&#x7528;&#x7B80;&#x4ECB;">Git &#x7684;&#x4F7F;&#x7528;&#x7B80;&#x4ECB;</h3>
<p>&#x597D;&#x6D88;&#x606F;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F; Linux &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5206;&#x53D1;&#x7248;&#x90FD;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x4E86; Git&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x4F7F;&#x7528;&#x6307;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x989D;&#x5916;&#x8FDB;&#x884C; Git &#x5B89;&#x88C5;&#x7684;&#x76F8;&#x5173;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x5B89;&#x88C5; Git &#x5DE5;&#x5177;&#x7684;&#x540C;&#x5B66;&#x8BF7;&#x76F4;&#x63A5;&#x5728;<a href="https://git-scm.com/downloads" target="_blank">Git &#x5B98;&#x7F51;</a>&#x4E0A;&#x67E5;&#x8BE2;&#x5BF9;&#x5E94;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="ssh-&#x8FDE;&#x63A5;-github">ssh &#x8FDE;&#x63A5; Github</h4>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x53C8;&#x8981;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x8BCD;&#x53EB; ssh &#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x548C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x7EC8;&#x7AEF;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x8FDE;&#x63A5;&#xFF0C;&#x4E0D;&#x8FC7;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4F60;&#x7684;&#x5BC6;&#x94A5;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x9700;&#x8981;&#x5728; Github &#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x4F60;&#x7684; ssh &#x5BC6;&#x94A5;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x5730;&#x5728; Github &#x4E0A;&#x4E0A;&#x4F20;&#x548C;&#x4E0B;&#x8F7D;&#x4EE3;&#x7801;&#x4E86;&#x3002;</p>
<h5 id="&#x751F;&#x6210;&#x516C;&#x79C1;&#x94A5;&#x5BF9;">&#x751F;&#x6210;&#x516C;&#x79C1;&#x94A5;&#x5BF9;</h5>
<p>&#x9996;&#x5148;&#x4F60;&#x9700;&#x8981;&#x751F;&#x6210;&#x4E00;&#x5BF9;&#x516C;&#x79C1;&#x5BC6;&#x94A5;&#x5BF9;&#xFF0C;&#x8FD9;&#x76F8;&#x5F53;&#x4E8E;&#x4F60;&#x7684; ssh &#x5BC6;&#x7801;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x8F93;&#x5165;&#x4E0B;&#x9762;&#x7684;&#x6307;&#x4EE4;</p>
<pre><code class="lang-sh">ssh-keygen -t rsa -b 4096 -C <span class="hljs-string">&quot;your_email@example.com&quot;</span> <span class="hljs-comment">#&#x6700;&#x540E;&#x8F93;&#x5165;&#x81EA;&#x5DF1;&#x7684;&#x90AE;&#x7BB1;&#x6216;&#x662F;&#x522B;&#x7684;&#x4F5C;&#x4E3A;&#x5907;&#x6CE8;</span>
</code></pre>
<p>&#x4E4B;&#x540E;&#x4F60;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x6536;&#x5230;&#x7C7B;&#x4F3C;&#x7684;&#x4FE1;&#x606F;&#xFF1A;</p>
<pre><code class="lang-sh">&gt; Generating public/private rsa key pair.
<span class="hljs-comment"># &#x4F60;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x50A8;&#x5B58;&#x79C1;&#x94A5;&#x7684;&#x8DEF;&#x5F84;</span>
<span class="hljs-comment"># &#x8BF7;&#x6CE8;&#x610F;&#x4F60;&#x9700;&#x8981;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F8;&#x5BF9;&#x672C;&#x76EE;&#x5F55;&#x7684;&#x8DEF;&#x5F84;</span>
&gt; Enter a file <span class="hljs-keyword">in</span> <span class="hljs-built_in">which</span> to save the key (/home/you/.ssh/id_rsa):[Press enter]
<span class="hljs-comment"># &#x4F60;&#x53EF;&#x4EE5;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#x6765;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E76;&#x4E0D;&#x5FC5;&#x987B;</span>
&gt; Enter passphrase (empty <span class="hljs-keyword">for</span> no passphrase): [Type a passphrase]
&gt; Enter same passphrase again: [Type passphrase again]
</code></pre>
<p>&#x5728;&#x5B8C;&#x6210;&#x4E0A;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4FDD;&#x5B58;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x516C;&#x79C1;&#x94A5;&#x5BF9;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#x4F60;&#x50A8;&#x5B58;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x4E3A;<code>id_rsa</code>&#x90A3;&#x4E48;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#xFF1A;<code>id_rsa</code>,<code>id_rsa.pub</code>&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x5177;&#x6709; .pub &#x7ED3;&#x5C3E;&#x7684;&#x6587;&#x4EF6;&#x662F;&#x4F60;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#xFF1B;&#x90A3;&#x4E2A;&#x6CA1;&#x6709;&#x540E;&#x7F00;&#x7684;&#x662F;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4E0D;&#x80FD;&#x7ED9;&#x522B;&#x4EBA;&#x770B;&#x5230;&#x3002;</p>
<p>&#x4E4B;&#x540E;&#x4F60;&#x9700;&#x8981;&#x628A;&#x4F60;&#x7684;&#x516C;&#x79C1;&#x94A5;&#x5BF9;&#x52A0;&#x5165;&#x5230;&#x4F60;&#x672C;&#x673A;&#x7684; ssh &#x5DE5;&#x5177;&#x4E2D;&#x53BB;&#x3002;&#x8FD0;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x6307;&#x4EE4;</p>
<pre><code class="lang-sh"><span class="hljs-built_in">eval</span> <span class="hljs-string">&quot;<span class="hljs-variable">$(ssh-agent -s)</span>&quot;</span>
ssh-add ~/.ssh/id_rsa
</code></pre>
<p>&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x516C;&#x79C1;&#x94A5;&#x5BF9;&#x589E;&#x52A0;&#x5230;&#x672C;&#x673A;&#x7684; ssh &#x5DE5;&#x5177;&#x4E2D;&#x3002;</p>
<h5 id="&#x628A;&#x516C;&#x94A5;&#x6DFB;&#x52A0;&#x5230;-github-&#x4E0A;">&#x628A;&#x516C;&#x94A5;&#x6DFB;&#x52A0;&#x5230; Github &#x4E0A;</h5>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4F60;&#x9700;&#x8981;&#x5728; Github &#x4E0A;&#x6DFB;&#x52A0;&#x4F60;&#x7684;&#x516C;&#x94A5;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x5B8C;&#x6210;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;</p>
<p>&#x5728;&#x767B;&#x5F55; Github &#x540E;&#x70B9;&#x51FB;&#x5934;&#x50CF;&#x8FDB;&#x5165; Settings</p>
<p><img src="../imgs/setting.png" alt="settings"></p>
<p>&#x9009;&#x62E9;&#x5DE6;&#x4FA7;&#x7684; SSH and GPG keys&#xFF0C;&#x4E4B;&#x540E;&#x70B9;&#x51FB;&#x53F3;&#x4E0A;&#x89D2;&#x7684; New SSH key</p>
<p><img src="../imgs/sshkey.png" alt="SSH and GPG"></p>
<p>&#x5C06;&#x4E4B;&#x524D;&#x751F;&#x6210;&#x7684; .pub &#x5BC6;&#x94A5;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x7C98;&#x8D34;&#x5230;&#x6807;&#x9898;&#x4E3A; Key &#x7684;&#x6587;&#x672C;&#x6846;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728; Title &#x4E2D;&#x7ED9;&#x5B83;&#x6807;&#x6CE8;&#x4E00;&#x4E2A;&#x540D;&#x79F0;</p>
<p><img src="../imgs/addkey.png" alt="Add new key"></p>
<p>&#x6700;&#x540E;&#x70B9;&#x51FB;&#x4E0B;&#x65B9;&#x7684;&#x6309;&#x94AE;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;</p>
<h5 id="&#x6D4B;&#x8BD5;&#x914D;&#x7F6E;">&#x6D4B;&#x8BD5;&#x914D;&#x7F6E;</h5>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528; ssh &#x5DE5;&#x5177;&#x5411; Github &#x53D1;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x8BF7;&#x6C42;&#x6765;&#x786E;&#x8BA4;&#x4E00;&#x4E0B;&#x914D;&#x7F6E;&#x6CA1;&#x6709;&#x9519;&#x8BEF;</p>
<pre><code class="lang-sh">ssh -T git@github.com
</code></pre>
<p>&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x6536;&#x5230;&#x7C7B;&#x4F3C;&#x4E0B;&#x9762;&#x7684;&#x4FE1;&#x606F;&#x5219;&#x8BF4;&#x660E;&#x914D;&#x7F6E;&#x6B63;&#x786E;</p>
<pre><code class="lang-sh">&gt; Hi yourname! You<span class="hljs-string">&apos;ve successfully authenticated, but GitHub does not provide shell access.
</span></code></pre>
<p>&#x5982;&#x679C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x53C2;&#x8003; Github &#x7684;&#x5B98;&#x65B9;&#x5F15;&#x5BFC; <a href="https://docs.github.com/en/free-pro-team@latest/github/authenticating-to-github/generating-a-new-ssh-key-and-adding-it-to-the-ssh-agent#" target="_blank">generating a new ssh key</a></p>
<p>&#x53E6;&#x6CE8;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x539F;&#x6765;&#x914D;&#x7F6E;&#x8FC7; Github &#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x5728;&#x672C;&#x673A;&#x4E0A;&#x8981;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x8FDE;&#x63A5;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7EC8;&#x7AEF;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x9700;&#x8981;&#x914D;&#x7F6E; ssh config &#x6587;&#x4EF6;&#x3002;&#x5173;&#x4E8E;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x914D;&#x7F6E;&#x8BF7;&#x81EA;&#x884C;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x641C;&#x7D22;&#x3002;</p>
<!-- 我不确定 mac 上是不是也差不多是这么做，请确认一下 -->
<h4 id="&#x4ECE;-github-&#x4E0A;-clone-&#x4ED3;&#x5E93;">&#x4ECE; Github &#x4E0A; clone &#x4ED3;&#x5E93;</h4>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x914D;&#x7F6E;&#x597D;&#x4E86; ssh &#x5BC6;&#x94A5;&#x4E86;&#xFF0C;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x51C6;&#x5907;&#x53BB;&#x4E0B;&#x8F7D;&#x4EE3;&#x7801;&#x4E86;&#x3002;</p>
<p>&#x5728; Git &#x4E2D;&#xFF0C;clone &#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x7533;&#x8BF7;&#x53BB;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x4E2A;&#x62F7;&#x8D1D;&#x3002;&#x6B64;&#x65F6;&#x4F60;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x6574;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x80FD;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#xFF08;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x6743;&#x9650;&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; fork &#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x4F60;&#x7684;&#x8BE5;&#x4ED3;&#x5E93;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x4FEE;&#x6539;&#x4FDD;&#x5B58;&#x5728; Github &#x4E0A;&#x9762;&#x3002;</p>
<p>&#x6240;&#x8C13; fork &#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x4F60;&#x4ECE;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x4E2D;&#x5206;&#x51FA;&#x4E00;&#x6761;&#x679D;&#x5B50;&#xFF0C;&#x6210;&#x4E3A;&#x4F60;&#x81EA;&#x5DF1;&#x5F00;&#x53D1;&#x7684;&#x5206;&#x652F;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x6B64;&#x65F6;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x7F16;&#x8F91;&#x548C;&#x4E0A;&#x4F20;&#x4F60;&#x7684;&#x4FEE;&#x6539;&#x800C;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x4ED3;&#x5E93;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x4FEE;&#x6539;&#x63D0;&#x4EA4;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x4E2D;&#x5219;&#x9700;&#x8981;&#x53D1;&#x5E03; pull request &#xFF0C;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E4B;&#x540E;&#x518D;&#x8BF4;&#x3002;</p>
<p>&#x8981; clone &#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x7B80;&#x5355;&#x4E86;&#xFF1A;&#x9996;&#x5148;&#x5230; Github &#x4E0A;&#x627E;&#x4E00;&#x4E2A;&#x770B;&#x7740;&#x987A;&#x773C;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x5B83;&#x7684;&#x4ED3;&#x5E93;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7EFF;&#x8272;&#x7684;&#x4E0B;&#x8F7D;&#x6309;&#x94AE;&#x3002;</p>
<p><img src="../imgs/clone.png" alt="clone"></p>
<p>&#x9009;&#x62E9; ssh &#xFF0C;&#x590D;&#x5236;&#x5185;&#x5BB9;&#x540E;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x8F93;&#x5165;</p>
<pre><code class="lang-sh">git <span class="hljs-built_in">clone</span> git@github.com/...
</code></pre>
<p>&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x5148;&#x514B;&#x9686;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x6863;&#x4ED3;&#x5E93;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code class="lang-sh">git <span class="hljs-built_in">clone</span> git@github.com:simonkorl/rustOS_learning_guide.git
</code></pre>
<p>&#x4E4B;&#x540E;&#x4F60;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E0B;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x540D;&#x79F0;&#x548C; clone &#x7684;&#x4ED3;&#x5E93;&#x76F8;&#x4E00;&#x81F4;&#x3002;&#x6B64;&#x65F6;&#x4F60;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x4E86;&#x8BE5;&#x4ED3;&#x5E93;&#x7684;&#x4E00;&#x4E2A;&#x590D;&#x5236;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x4E0A;&#x4F20;&#x548C;&#x4FDD;&#x5B58;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x5C06;&#x4ED3;&#x5E93; fork &#x5230;&#x81EA;&#x5DF1;&#x7684;&#x8D26;&#x53F7;&#x4E0B;&#x3002;&#x901A;&#x8FC7;&#x70B9;&#x51FB;&#x4ED3;&#x5E93;&#x4E0A;&#x7684; fork &#x6309;&#x94AE;&#x3002;</p>
<p><img src="../imgs/fork.png" alt="fork"></p>
<p>&#x4E4B;&#x540E;&#x91CD;&#x65B0;&#x8FDB;&#x884C; clone &#x64CD;&#x4F5C;&#x5373;&#x53EF;&#x3002;</p>
<h4 id="&#x65B0;&#x5EFA;&#x4ED3;&#x5E93;&#x4E0E;&#x7F16;&#x8F91;">&#x65B0;&#x5EFA;&#x4ED3;&#x5E93;&#x4E0E;&#x7F16;&#x8F91;</h4>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#xFF0C;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x8BB0;&#x5F55;&#x7684;&#x4FDD;&#x5B58;&#x4ED3;&#x5E93;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B8C;&#x6210;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5206;&#x522B;&#x5728;&#x672C;&#x5730;&#x548C; Github &#x5EFA;&#x7ACB;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4E24;&#x8005;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x672C;&#x5730;&#x5EFA;&#x7ACB;&#x4ED3;&#x5E93;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x4F7F;&#x7528;<code>git init</code>&#x547D;&#x4EE4;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x5728;&#x7528;&#x6237;&#x76EE;&#x5F55;&#x4E0B;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x4ED3;&#x5E93;</p>
<p>Linux</p>
<pre><code class="lang-sh"><span class="hljs-built_in">cd</span> ~ <span class="hljs-comment"># &#x56DE;&#x5230;&#x7528;&#x6237;&#x7684;&#x6839;&#x76EE;&#x5F55;</span>
mkdir rCore_learning <span class="hljs-comment"># &#x65B0;&#x5EFA;&#x76EE;&#x5F55;</span>
<span class="hljs-built_in">cd</span> rCore_learning <span class="hljs-comment"># &#x8FDB;&#x5165;&#x76EE;&#x5F55;</span>

git init <span class="hljs-comment"># &#x521D;&#x59CB;&#x5316; git &#x4ED3;&#x5E93;</span>
</code></pre>
<p>&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x8FDC;&#x7A0B;&#x7684;&#x4ED3;&#x5E93;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728; Github &#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x53F3;&#x4E0A;&#x89D2;&#x7684; + &#x56FE;&#x6807;&#x9009;&#x62E9; New repository</p>
<p><img src="../imgs/create.png" alt="&#x521B;&#x5EFA;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;"></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x662F;&#x516C;&#x5F00;&#x7684; public &#x8FD8;&#x662F;&#x79C1;&#x6709;&#x7684; private&#x3002;&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x4F60;&#x5C06;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x516C;&#x5F00;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5206;&#x4EAB;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5230;&#x5176;&#x4ED6;&#x7684;&#x540C;&#x5B66;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684; README &#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF0C;&#x5B83;&#x4F1A;&#x9ED8;&#x8BA4;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x653E;&#x5728;&#x4F60;&#x7684;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x4E2D;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x548C; Github &#x4E0A;&#x6837;&#x5B50;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x4ED3;&#x5E93;&#x754C;&#x9762;&#x3002;&#x540C;&#x6837;&#x662F;&#x9009;&#x62E9;&#x5B83;&#x7684; ssh &#x90E8;&#x5206;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5728;&#x4F60;&#x7684;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x4E2D;&#x4F7F;&#x7528;</p>
<pre><code class="lang-sh">git remote add origin git@github.com/...
</code></pre>
<p>&#x8FD9;&#x53E5;&#x8BDD;&#x7684;&#x542B;&#x4E49;&#x662F;&#x4E3A;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8FDC;&#x7A0B;&#x7684;&#x540C;&#x6B65;&#x4ED3;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x5176;&#x547D;&#x540D;&#x4E3A; origin&#x3002;</p>
<h4 id="&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x4E0E;&#x540C;&#x6B65;">&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x4E0E;&#x540C;&#x6B65;</h4>
<p><img src="../imgs/git.png" alt="git&#x72B6;&#x6001;&#x793A;&#x610F;&#x56FE;"></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x548C;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#xFF0C;&#x4F46;&#x662F;&#x4E24;&#x8FB9;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x9996;&#x5148;&#x83B7;&#x5F97;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;<code>git fetch</code>&#x6765;&#x83B7;&#x53D6;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x7684;&#x4FE1;&#x606F;&#x6216;&#x8005;&#x6267;&#x884C;<code>git pull</code>&#x76F4;&#x63A5;&#x5C06;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x5185;&#x5BB9;&#x5408;&#x5E76;&#x5230;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x5219; Git &#x4F1A;&#x76F4;&#x63A5;&#x5408;&#x5E76;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4F1A;&#x8BF7;&#x6C42;&#x4F60;&#x624B;&#x52A8;&#x5408;&#x5E76;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x672C;&#x5730;&#x4ED3;&#x5E93;&#x7684;&#x6587;&#x4EF6;&#x6709;&#x4E09;&#x4E2A;&#x72B6;&#x6001;&#xFF1A;</p>
<ol>
<li>&#x672A;&#x8DDF;&#x8E2A;&#xFF08;untracked&#xFF09;&#xFF1A;&#x8FD9;&#x7C7B;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x88AB; Git &#x4FDD;&#x5B58;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x4E0A;&#x4F20;&#x3002;&#x4F7F;&#x7528;<code>git add filename</code>&#x7684;&#x65B9;&#x6CD5;&#x6DFB;&#x52A0;&#x6587;&#x4EF6;&#x6216;&#x8005;&#x6DFB;&#x52A0;&#x76EE;&#x5F55;&#xFF0C;&#x5982;<code>git add .</code>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x3002;</li>
<li>&#x5DF2;&#x4FEE;&#x6539;&#xFF08;modified&#xFF09;&#xFF1A;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x5982;&#x679C;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#xFF0C;&#x5219;&#x4F1A;&#x8FDB;&#x5165;&#x5230;&#x5DF2;&#x4FEE;&#x6539; modified &#x7684;&#x72B6;&#x6001;&#x3002;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>git add</code>&#x6307;&#x4EE4;&#x6765;&#x8BF4;&#x660E;&#x54EA;&#x4E9B;&#x6587;&#x4EF6;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x5DF2;&#x7ECF;&#x4FEE;&#x6539;&#x7684;&#x72B6;&#x6001;</li>
<li>&#x6682;&#x5B58;&#xFF08;staged&#xFF09;&#xFF1A;&#x88AB;<code>git add</code>&#x6307;&#x4EE4;&#x6DFB;&#x52A0;&#x7684;&#x6587;&#x4EF6;&#x5904;&#x4E8E;&#x6682;&#x5B58;&#x533A;&#xFF0C;&#x72B6;&#x6001;&#x4E3A; staged &#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x7684;&#x4FEE;&#x6539;&#x5DF2;&#x7ECF;&#x6682;&#x5B58;&#x5728;&#x672C;&#x5730;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>git commit</code>&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#xFF08;&#x5728;&#x672C;&#x5730;&#xFF09;</li>
</ol>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x5728;&#x76EE;&#x5F55;&#x4E0B;&#x7684;<code>README.md</code>&#x6587;&#x4EF6;&#x4E2D;&#x7A0D;&#x5FAE;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x4E00;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-markdown"><span class="hljs-section"># rCore_learning</span>

&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x8BB0;&#x5F55;&#x4E86;&#x5B66;&#x4E60; Rust &#x4E0E; rCore &#x7684;&#x8FC7;&#x7A0B;
</code></pre>
<p>&#x4E4B;&#x540E;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;</p>
<pre><code class="lang-sh">git add README.md
git commit -m <span class="hljs-string">&quot;&#x4FEE;&#x6539;&#x4E86; README.md&quot;</span>
</code></pre>
<p>&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x3002;&#x6CE8;&#x610F;<code>git commit</code>&#x540E;&#x9762;&#x7684;&#x53C2;&#x6570;&#x4EE3;&#x8868;&#x63D0;&#x4EA4;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x76F4;&#x63A5;&#x6DFB;&#x52A0;&#x7684;&#x8BDD;&#x7CFB;&#x7EDF;&#x4F1A;&#x9ED8;&#x8BA4;&#x6253;&#x5F00;&#x547D;&#x4EE4;&#x884C;&#x4F7F;&#x7528; GNU nano &#x7F16;&#x8F91;&#x5668;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x6587;&#x672C;&#x7684;&#x7F16;&#x8F91;&#x3002;&#x8FD9;&#x4E2A;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x952E;&#x7684;&#x7ED1;&#x5B9A;&#x65B9;&#x6CD5;&#x4E5F;&#x6BD4;&#x8F83;&#x5947;&#x602A;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x7528;&#x65B9;&#x5411;&#x952E;&#x79FB;&#x52A8;&#x5149;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#x6587;&#x5B57;&#x3002;&#x4F7F;&#x7528; Ctrl + X &#x8FDB;&#x884C;&#x9000;&#x51FA;&#x5E76;&#x4E14;&#x9009;&#x62E9;&#x662F;&#x5426;&#x4FDD;&#x5B58;&#xFF08;y/n&#xFF09;&#xFF0C;&#x4E4B;&#x540E;&#x4F7F;&#x7528;&#x56DE;&#x8F66;&#x5373;&#x53EF;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x5728;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x672C;&#x5730;&#x7684;&#x4FEE;&#x6539;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5DF2;&#x7ECF;&#x8FDB;&#x884C;&#x4E86;&#x4FDD;&#x5B58;&#xFF1A;&#x4F60;&#x63D0;&#x4EA4;&#x4E86;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x8BB0;&#x5F55;&#xFF0C;&#x8BB0;&#x5F55;&#x4E86;&#x4E0E;&#x4E0A;&#x4E00;&#x6B21;&#x8BB0;&#x5F55;&#x76F8;&#x6BD4;&#x4ED3;&#x5E93;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x6709;&#x4E86;&#x4EC0;&#x4E48;&#x4FEE;&#x6539;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x8FD8;&#x7559;&#x5728;&#x672C;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5C06;&#x4FEE;&#x6539;&#x4FDD;&#x5B58;&#x5230;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x9700;&#x8981;&#x6267;&#x884C;<code>git push</code>&#x64CD;&#x4F5C;&#xFF0C;&#x8BF4;&#x660E;&#x5229;&#x7528;&#x672C;&#x5730;&#x7684;&#x4ED3;&#x5E93;&#x66F4;&#x65B0;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x3002;</p>
<pre><code class="lang-sh">git push -u origin master
</code></pre>
<p>&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>git push -u origin master</code>&#x7684;&#x65B9;&#x6CD5;&#x6307;&#x5B9A;&#x6211;&#x4EEC;&#x672C;&#x5730;&#x7684;&#x5206;&#x652F;&#x4E0E;&#x8FDC;&#x7AEF;&#x5206;&#x652F;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x81F3;&#x4E8E;&#x5206;&#x652F;&#x7684;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x8FD8;&#x8BF7;&#x81EA;&#x884C;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x548C;&#x5B66;&#x4E60;&#x3002;&#x5728;&#x4E4B;&#x540E;&#x7684; push &#x64CD;&#x4F5C;&#x4E2D;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;<code>git push</code>&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6CE8;&#xFF1A;&#x5982;&#x679C;&#x672C;&#x5730;&#x4E0E;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#x4E0D;&#x540C;&#x6B65;&#xFF0C;&#x5219; Git &#x4F1A;&#x63D0;&#x9192;&#x4F60;&#x5148;&#x6267;&#x884C; pull &#x540E;&#x6267;&#x884C; push &#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FDC;&#x7AEF;&#x7684;&#x4ED3;&#x5E93;&#x4EE3;&#x7801;&#x88AB;&#x7834;&#x574F;&#x3002;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x5F3A;&#x884C;&#x66FF;&#x6362;&#x8FDC;&#x7AEF;&#x4ED3;&#x5E93;&#xFF0C;&#x4F46;&#x662F;&#x5F3A;&#x70C8;&#x4E0D;&#x63A8;&#x8350;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x9664;&#x975E;&#x5FC5;&#x8981;&#x60C5;&#x51B5;&#xFF0C;&#x5426;&#x5219;&#x4E00;&#x5B9A;&#x8981;&#x786E;&#x8BA4;&#x4E00;&#x4E0B;&#x8FDC;&#x7A0B;&#x4ED3;&#x5E93;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x5230;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7ED3;&#x675F;&#x4E86; Git &#x7684;&#x57FA;&#x672C;&#x4F7F;&#x7528;&#x4ECB;&#x7ECD;&#x3002;&#x6709;&#x4E00;&#x4E9B;&#x7F16;&#x8F91;&#x5668;&#x4F1A;&#x63D0;&#x4F9B;&#x7ED9;&#x4F60;&#x56FE;&#x5F62;&#x5316;&#x7684;&#x754C;&#x9762;&#x6765;&#x64CD;&#x4F5C; Git&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x501F;&#x52A9;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x66F4;&#x5FEB;&#x6377;&#x5730;&#x4F7F;&#x7528; Git&#x3002;&#x5728;&#x4E4B;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x6574;&#x7406;&#x4E3A;&#x6587;&#x6863;&#x4FDD;&#x5B58;&#x5728;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x4E2D;&#x548C;&#x4ED6;&#x4EBA;&#x8FDB;&#x884C;&#x5171;&#x4EAB;&#x3002;</p>
<h2 id="&#x788E;&#x788E;&#x5FF5;">&#x788E;&#x788E;&#x5FF5;</h2>
<h3 id="linux-&#x548C;&#x7F16;&#x8F91;&#x5668;">Linux &#x548C;&#x7F16;&#x8F91;&#x5668;</h3>
<p>&#x5728;&#x7F16;&#x8005;&#x521A;&#x521A;&#x63A5;&#x89E6; Linux &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x5730;&#x8981;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x5E76;&#x4E14;&#x8FDB;&#x884C;&#x7F16;&#x8F91;&#x3002;&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x662F; vim &#xFF0C;&#x7ED3;&#x679C;&#x4E00;&#x4E0A;&#x6765;&#x5C31;&#x9047;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x5F88;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x6211;&#x600E;&#x4E48;&#x7F16;&#x8F91;&#x554A;&#xFF1F;</li>
<li>&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x600E;&#x4E48;&#x5173;&#x4E0A;&#x554A;&#xFF1F;</li>
</ol>
<p>&#x5C24;&#x5176;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x8BB0;&#x5F55;&#x5728;&#x300A;&#x7A0B;&#x5E8F;&#x5458;&#x8BED;&#x5F55;&#x300B;&#x5F53;&#x4E2D;&#x4E86;&#xFF0C;&#x636E;&#x8BF4;&#x8FD8;&#x6709;&#x4E00;&#x4E2A; stackoverflow &#x7684;&#x5E16;&#x5B50;&#x4E13;&#x95E8;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5173;&#x95ED; vim &#x3002;</p>
<p>vim &#x662F;&#x73B0;&#x5728;&#x5E38;&#x89C1;&#x7684; Linux &#x5206;&#x53D1;&#x4E2D;&#x7684;&#x5185;&#x7F6E;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x7F16;&#x8005;&#x5F53;&#x65F6;&#x8D39;&#x4E86;&#x534A;&#x5929;&#x52B2;&#xFF0C;&#x5728;&#x952E;&#x76D8;&#x4E0A;&#x778E;&#x6309;&#x4E86;&#x4E00;&#x901A;&#x624D;&#x6210;&#x529F;&#x5730;&#x8BA9;&#x6E38;&#x6807;&#x7F16;&#x7A0B;&#x719F;&#x6089;&#x7684;&#x7AD6;&#x7EBF;&#x7684;&#x6837;&#x5B50;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x7ED3;&#x679C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x7F16;&#x8F91;&#x5B8C;&#xFF0C;Ctrl + s &#x4E5F;&#x4E0D;&#x597D;&#x7528;&#xFF0C;&#x9000;&#x51FA;&#x7684;&#x8BDD; ESC &#x952E;&#x4E5F;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x6572; Ctrl + C &#x60F3;&#x8981;&#x5F3A;&#x5236;&#x9000;&#x51FA;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x6709;&#x63D0;&#x793A;</p>
<pre><code class="lang-sh">Type  :qa!  and press &lt;Enter&gt; to abandon all changes and <span class="hljs-built_in">exit</span> Vim
</code></pre>
<p>&#x7ED3;&#x679C;&#x6298;&#x817E;&#x4E86;&#x597D;&#x534A;&#x5929;&#x624D;&#x628A;&#x6587;&#x4EF6;&#x7F16;&#x8F91;&#x4FDD;&#x5B58;&#x4E86;&#x3002;</p>
<p>&#x521A;&#x5F00;&#x59CB;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x7684;&#x662F; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x4E0A;&#x6765;&#x7ED9;&#x51FA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EE5;&#x547D;&#x4EE4;&#x4E3A;&#x4E3B;&#xFF0C;&#x4E14;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x90FD;&#x6CA1;&#x6709;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x786E;&#x5B9E;&#x8BA9;&#x4EBA;&#x975E;&#x5E38;&#x5934;&#x75BC;&#x3002;vim &#x62E5;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6A21;&#x5F0F;&#xFF08;mode&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x4E0A;&#x624B;&#x4F1A;&#x8BA9;&#x4EBA;&#x6478;&#x4E0D;&#x7740;&#x5934;&#x8111;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5E94;&#x8BE5;&#x90FD;&#x5C5E;&#x4E8E;&#x5143;&#x8001;&#x7EA7;&#x522B;&#xFF0C;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x9661;&#x5CED;&#x4E14;&#x201C;&#x602A;&#x5F02;&#x201D;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x9AD8;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x5E08;&#x624D;&#x80FD;&#x719F;&#x7EC3;&#x638C;&#x63E1;&#x5E76;&#x4E14;&#x53D1;&#x6325;&#x5176;&#x6700;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4F5C;&#x4E3A;&#x65B0;&#x624B;&#x7684;&#x8BDD;&#x6211;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x5148;&#x4ECE;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5F00;&#x59CB;&#xFF1A;&#x54B1;&#x4EEC;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5199;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x800D;&#x5E05;&#x7684;&#x3002;&#x8981;&#x662F;&#x6709;&#x4EC0;&#x4E48;&#x4EBA;&#x5411;&#x4F60;&#x5B89;&#x5229; vim&#xFF0C;emacs &#x4E00;&#x7C7B;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5927;&#x53EF;&#x5938;&#x5BF9;&#x65B9;&#x4E24;&#x53E5;&#x201C;&#x5927;&#x795E;&#x201D;&#x7136;&#x540E;&#x56DE;&#x7EDD;&#x6389;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="goodbye-windows.html" class="navigation navigation-prev " aria-label="Previous page: Goodbye Windows">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../rust-jumpstart/what-is-this.html" class="navigation navigation-next " aria-label="Next page: 这是什么">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"description":"工欲善其事必先利其器","title":"编程工具","level":"2.4","depth":1,"next":{"title":"这是什么","level":"3.1","depth":1,"path":"docs/rust-jumpstart/what-is-this.md","ref":"docs/rust-jumpstart/what-is-this.md","articles":[]},"previous":{"title":"Goodbye Windows","level":"2.3","depth":1,"path":"docs/introduction/goodbye-windows.md","ref":"docs/introduction/goodbye-windows.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"docs/introduction/tools.md","mtime":"2020-11-03T06:12:06.410Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-11-03T06:12:50.527Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

